
//=====================头文件====================================
#include "AAA-Include.h"
//=====================私有定义====================================






//================================================================================
//================================================================================
void I2C_delay(void)
{
//uint8_t 			i = 10;
//while (i)			i--;
return;
}
//================================================================================


//================================================================================
//================================================================================
void IIC_Start(void)
{
		SCL_1;
		SDA_1;		
		I2C_delay();	
		
		SDA_0;								
		I2C_delay();	
		
		SCL_0;						//	钳住I2C总线，准备发送或接收数据 	
		I2C_delay();	
}

//===================================
void IIC_Stop(void)
{
		SCL_0;
		SDA_0;
		I2C_delay();
		
		SCL_1;
		I2C_delay();
				
		SDA_1;			
		I2C_delay();	
}

//===================================





//========================================================
//========================================================
uint8_t I2C_WaitAck(void)
{
uint8_t ucErrTime=0;

	I2C_delay();
	SCL_1;
	
	while(!SCL_read)
		{
			ucErrTime++;
			if(ucErrTime>250)
				{
					IIC_Stop();return 1;
				}
		}
				
	while(SDA_read)
		{
			ucErrTime++;
			if(ucErrTime>250)
				{
					IIC_Stop();return 1;
				}
		}
	
  SCL_0;   
	I2C_delay();
	return 0;
}
//========================================================
//========================================================







//===================================
void I2C_Ack(void)
{
    SCL_0;	
    SDA_0;	
		I2C_delay();
    SCL_1;	
		I2C_delay();
    SCL_0;
		//I2C_delay();			
    SDA_1;	
		I2C_delay();

}
void I2C_NoAck(void)
{
    SCL_0;
    SDA_1;	
		I2C_delay();
    SCL_1;	
		I2C_delay();
    SCL_0;	
		I2C_delay();
}
//========================================================
//========================================================





















//========================================================
//========================================================
void I2C_SendByte(uint8_t byte)
{
	uint8_t t;  
   
		SCL_0;	//拉低时钟开始数据传输
		I2C_delay();

    for(t=0;t<8;t++)
			{              
			  if ((byte & 0x80) == 0x80)
					{SDA_1;}
        else
					{SDA_0;}
        byte <<= 1;	
					
				I2C_delay();
			  SCL_1;		
				I2C_delay();
			  SCL_0;	
				I2C_delay();						
    }	
		
		SDA_1;
}
//========================================================
uint8_t I2C_ReceiveByte(uint8_t ack)
{		
    uint8_t i;
    uint8_t byte = 0;
			
		SCL_0;	 
		I2C_delay();
				
		for(i=0;i<8;i++ )
			{
        SCL_1;
        byte<<=1;
				
				if (SDA_read) 
						byte++; 
								
				SCL_0;	 
        I2C_delay();
			}	
						
    if (!ack)
        I2C_NoAck();					//	发送nACK
    else
       I2C_Ack(); 						//	发送ACK   

    return byte;
}
//======================================================================================================================
//======================================================================================================================










//======================================================================================================================
//======================================================================================================================
//======================================================================================================================
////IIC写一个字节 
////reg:寄存器地址
////data:数据
////返回值:0,正常
////    其他,错误代码
uint8_t I2C_Write_One_Byte(uint8_t addr,uint8_t reg,uint8_t data)				 
{ 
  IIC_Start(); 
	
	I2C_SendByte((addr<<1)|0);//发送器件地址+写命令	
				if(I2C_WaitAck())	//等待应答
					{IIC_Stop();	 return 1;}		
	
  I2C_SendByte(reg);	//写寄存器地址
				if(I2C_WaitAck())	//等待应答
					{IIC_Stop();	 return 1;}		
	
	I2C_SendByte(data);//发送数据
				if(I2C_WaitAck())	//等待ACK
					{IIC_Stop();	 return 1;}		

	IIC_Stop();	 
	return 0;
}




////IIC读一个字节 
////reg:寄存器地址 
////返回值:读到的数据
uint8_t I2C_Read_One_Byte(uint8_t addr,uint8_t reg)
{
	u8 res;
  
	IIC_Start(); 
	
	I2C_SendByte((addr<<1)|0);//发送器件地址+写命令	
			I2C_WaitAck();		//等待应答 
	
  I2C_SendByte(reg);	//写寄存器地址
			I2C_WaitAck();		//等待应答
	
  IIC_Start();
	
	I2C_SendByte((addr<<1)|1);//发送器件地址+读命令	
			I2C_WaitAck();		//等待应答 
	
	res = I2C_ReceiveByte(0);//读取数据,发送nACK 
    
	IIC_Stop();			//产生一个停止条件 
	
	return res;		
}
//======================================================================================================================
//======================================================================================================================
//======================================================================================================================



//======================================================================================================================
//======================================================================================================================
//======================================================================================================================
//IIC连续写
//addr:器件地址 
//reg:寄存器地址
//len:写入长度
//buf:数据区
//返回值:0,正常
//    其他,错误代码
u8 MPU_Write_Len(u8 addr,u8 reg,u8 len,u8 *buf)
{
	u8 i;
  IIC_Start(); 
	
	I2C_SendByte((addr<<1)|0);			//发送器件地址+写命令	
			if(I2C_WaitAck())          	//等待应答
						{IIC_Stop();		return 1;}
	
  I2C_SendByte(reg);							//写寄存器地址
			if(I2C_WaitAck())          	//等待应答
						{IIC_Stop();		return 1;}
	
   for(i=0;i<len;i++)
    {	
				I2C_SendByte(buf[i]);		//发送数据
				if(I2C_WaitAck())    		//等待应答
							{IIC_Stop();		return 1;}	
    }
		
	IIC_Stop();	 
	return 0;


} 

//IIC连续读
//addr:器件地址
//reg:要读取的寄存器地址
//len:要读取的长度
//buf:读取到的数据存储区
//返回值:0,正常
//    其他,错误代码
u8 MPU_Read_Len(u8 addr,u8 reg,u8 len,u8 *buf)
{ 
  IIC_Start(); 
	
	I2C_SendByte((addr<<1)|0);//发送器件地址+写命令	
	if(I2C_WaitAck())          //等待应答
				{IIC_Stop();		return 1;}
	
  I2C_SendByte(reg);	//写寄存器地
	if(I2C_WaitAck())          //等待应答
				{IIC_Stop();		return 1;}
	
  IIC_Start();
	
	I2C_SendByte((addr<<1)|1);//发送器件地址+读命令	
	if(I2C_WaitAck())          //等待应答
				{IIC_Stop();		return 1;}
				
	while(len)
    {
        if(len==1)
					{*buf=I2C_ReceiveByte(0);}		//读数据,发送nACK 
				else 
					{*buf=I2C_ReceiveByte(1);}		//读数据,发送ACK  
				len--;
				buf++;  
    }
					
	IIC_Stop();			//产生一个停止条件 
	return 0;				
}

//======================================================================================================================
//======================================================================================================================
//======================================================================================================================




























